/*
События на мобильных браузерах:

touchstart - Вонзникает при косании к элементу
touchmove - Событие вызывается при косании и движении по элементу пальцем
touchend - выполняется когда палец отрывается от элемента.
touchenter - срабатывает когда проскальзываем пальцем по экрану и наскакиваем на какое-то 
  элемент, на который повешено это событие.
touchkeave - палец скользит за пределы элемента.
touchcancel - возникает когда точка соприкосновения больше не реггестрируется на поверхности
*/

// document.addEventListener('DOMContentLoaded', () => {

// })
 
//Свойства при работе с сенсорными устройствами:
// touches
// targetTouches
// changedTouches 