"use strict";

/*
Немного про git
*/

/*
cd/... - переход в нужную папку;

git config user.name "Stas" user email ..@gmail.com -Установка конфигураций (--local -локально, --global -глобально);
git status - смотрим статус / файлы проекта;

git add - Добавляем файлы в индекс;
git add -A - Добавляем все файлы в индекс;
git add. - Добавляем в индекс все файлы в текущей папке;
git add style.css - добавляем конкретный файл в индекс;

git commit -a -m"first commit" - Создаем со всеми файлами коммит с описанием;
git log - смотрим логи коммитов;

git push -u -origine master - отправляем файлы в определенный репозиторий;
git fetch - связывается с удалённым репозиторием и забирает из него все изменения, которых у вас пока нет и сохраняет их локально.
git pull - работает как комбинация команд git fetch и git merge, т. е. Git вначале забирает изменения из указанного удалённого репозитория, а затем пытается слить их с текущей веткой.
git clone https://... it projects - клонируем удаленный репозиторий себе на компьютер в конкретную папку;

git checkout -b -создаем и переключаемся на новую ветку;
*/
